{
  "personal": {
    "name": "Gökcan Akoya",
    "title": "Senior Backend Developer",
    "email": "gokcan.akoya@gmail.com",
    "phone": "+90 (507) 345-8765",
    "location": "Eskişehir, Turkey",
    "avatar": "https://raw.githubusercontent.com/Gokcann/aboutme/master/old-site/assets/images/Konu.png",
    "social": {
      "linkedin": "https://www.linkedin.com/in/gokcanakoya/",
      "github": "https://github.com/Gokcann",
      "twitter": "https://twitter.com/Gokcan26",
      "instagram": "https://www.instagram.com/gokcan.26/"
    }
  },
  "about": {
    "description": [
      "I approach every project with a commitment to two core principles: continuous learning and continuous development—both of myself and the systems I build.",
      "My goal is simple: write code that doesn't just work, but that genuinely improves how people do their work."
    ]
  },
  "services": [
    {
      "title": "Microservices Architecture",
      "description": "Designing and developing scalable microservices using Node.js/NestJS, Java/Spring Boot with event-driven architecture and cloud-native deployment.",
      "icon": "code"
    },
    {
      "title": "Database & Performance",
      "description": "Optimizing PostgreSQL, implementing Redis caching, Elasticsearch for search, and strategic indexing for high-performance systems.",
      "icon": "database"
    },
    {
      "title": "Cloud & DevOps",
      "description": "Building production-ready ecosystems with AWS (ECS, Fargate), Docker, Kubernetes, and comprehensive monitoring with Grafana/Prometheus.",
      "icon": "cpu"
    }
  ],
  "education": [
    {
      "institution": "Dokuz Eylul University",
      "degree": "Bachelor of Computer Science",
      "faculty": "Faculty of Science",
      "period": "2013 — 2018"
    }
  ],
  "experience": [
    {
      "title": "Eva Commerce Inc. - Senior Software Developer",
      "period": "2024 April — Present",
      "responsibilities": [
        "Microservices Architecture & Infrastructure – Developed 5 core microservices using Node.js/NestJS (Order Processing, Product Catalog, Inventory Management, Pricing Service, Notification Service). Implemented AWS ECS Fargate deployment reducing infrastructure costs by 28%. RabbitMQ event-driven architecture reduced inter-service dependencies and deployment time by 50%.",
        "Database & Performance Optimization – Optimized PostgreSQL queries with strategic indexing, improving critical endpoint response times by 65% (from 2.1s to 730ms). Integrated Redis caching reducing database load by 40%. Implemented Elasticsearch achieving 6x faster search performance (from 3.2s to 520ms).",
        "Monitoring & Observability – Set up comprehensive monitoring stack using AWS CloudWatch and Grafana, reducing MTTR by 35%. Implemented distributed tracing with custom metrics for proactive performance bottleneck identification.",
        "API Integration & Scalability – Built robust marketplace integration layer handling 60K+ daily API requests across Amazon SP-API and Walmart. Implemented rate limiting and circuit breaker patterns for high API success rate under load."
      ]
    },
    {
      "title": "Agito - Software Developer",
      "period": "2021 April — 2024 January",
      "responsibilities": [
        "Led the migration of legacy PL/SQL business logic to modern Java (Spring Boot) architecture within a distributed backend system serving millions of users.",
        "Improved query tuning in complex insurance policy and claims management modules on Oracle DB, reducing performance bottlenecks and shortening reporting times.",
        "Redesigned API connections with external services (payment gateways, government integrations) for high fault tolerance and system resilience.",
        "Resolved critical production bugs through deep-dive root cause analysis, implementing permanent solutions to improve customer satisfaction.",
        "Contributed to non-life insurance branch module development, running parallel development cycles with life and pension branches."
      ]
    },
    {
      "title": "Metasoft - Jr. Software Developer",
      "period": "2020 May — 2021 March",
      "responsibilities": [
        "Developed HL7 protocol-based integrations to transfer real-time data from hospital laboratory equipment to the central Hospital Information Management System (HIMS).",
        "Modified and adapted open-source reporting tools to meet specific institutional needs, significantly increasing operational efficiency.",
        "Resolved data synchronization issues between desktop and web-based modules, minimizing workflow interruptions for doctors and nurses."
      ]
    }
  ],
  "skills": [
    "Java",
    "JavaScript",
    "Spring Boot",
    "NestJS",
    "PostgreSQL",
    "Redis",
    "Kafka",
    "Docker",
    "Kubernetes",
    "AWS",
    "Elasticsearch",
    "MongoDB",
    "RabbitMQ",
    "Grafana",
    "Git"
  ],
  "projects": [
    {
      "title": "Inventory Intelligence Engine",
      "description": "High-performance inventory management system using Java 21, Spring Boot 3.4, and Spring Modulith with Virtual Threads for high-throughput concurrency. Features atomic stock reservation with Redis Lua scripts, 'Redis-first' caching with PostgreSQL fallback, and full DevOps ecosystem with Docker, Kubernetes, GitHub Actions CI/CD, and Prometheus/Micrometer metrics.",
      "technologies": ["Java 21", "Spring Boot 3.4", "Spring Modulith", "Redis", "PostgreSQL", "Docker", "Kubernetes", "Prometheus"],
      "github": "https://github.com/Gokcann/inventory-intelligence-engine"
    },
    {
      "title": "EV-Exchange",
      "description": "High-performance RESTful API for real-time stock market data and concurrent buy/sell orders. Features JWT authentication, secure transaction processing, and portfolio management across MongoDB and PostgreSQL. Built with ES6+ standards and MVC architecture for optimized API response times.",
      "technologies": ["Node.js", "Express.js", "MongoDB", "PostgreSQL", "JWT", "AWS EC2"],
      "github": "https://github.com/Gokcann/EvaExchange"
    },
    {
      "title": "Trend Analytics",
      "description": "Enterprise SaaS platform for Trendyol sellers. Buy Box optimization with 4-factor scoring algorithm, smart pricing strategies, competitor tracking with anti-detection, and real-time notifications.",
      "technologies": ["NestJS", "PostgreSQL", "TimescaleDB", "Redis", "Puppeteer", "React"],
      "isPrivate": true
    },
    {
      "title": "Google Maps Scraper",
      "description": "Web scraper for collecting pharmacy data across Turkish cities. Features CAPTCHA detection, stealth mode, rate limiting, and data validation with retry mechanisms.",
      "technologies": ["Python", "FastAPI", "Playwright", "PostgreSQL", "React"],
      "github": "https://github.com/Gokcann/google-maps-scraper",
      "isPrivate": true
    }
  ]
}
